// See https://aka.ms/new-console-template for more information
//Типи даних
//int, string, bool, double, float, char
/*
Console.Write("Enter a = ");
//str - Це змінна яка зберігає рядок
string str = Console.ReadLine(); // Що повертає ReadLine()?
//Console.WriteLine(str);
int a = int.Parse(str); //Перетворення рядка в ціле число

switch (a)
{ //Блок коду switch
    case 1:
        { //Блок коду case
            Console.WriteLine("Case 1: a = 1");
            break; //Перерває блок Вихід з блоку switch
        }
    case 2:
        {
            Console.WriteLine("Case 2: a = 2");
            break;
        }

}
*/
//Цикли
int n = 3; //кількість повторів циклу
//інціалізація_циклу; - Виконуєть на початку циклу 1 раз - стартові дані для циклу
//умова_циклу; - перевірка умови, якщо вона вірна то цикл працює і входу у тіло циклу
//ітеротор_циклу - виконуєть після тіла циклу, змінює ініціалізатора циклу (i)
//for(інціалізація_циклу; умова_циклу; ітератор_циклу)
//Блок коду циклу
//{  //Початок блоку коду
//    Console.WriteLine("Hello World!");
//} //Кінець блоку коду

for(int i = 0; i < n; i = i+1)
{ //Початок блоку коду
    Console.WriteLine("Hello World!");
} //Кінець блоку коду

//Перша ітерація
//i = 0; - інціалізація_циклу
//0 < 3; - умова_циклу - виконується
//Hello World! - тіло циклу
//i = 0 + 1 = 1; - ітератор_циклу - збільшення лічильника

//Друга ітерація
//i = 1; - інціалізація_циклу
//1 < 3; - умова_циклу - виконується
//Hello World! - тіло циклу
//i = 1 + 1 = 2; - ітератор_циклу - збільшення лічильника

//Третя ітерація
//i = 2; - інціалізація_циклу
//2 < 3; - умова_циклу - виконується
//Hello World! - тіло циклу
//i = 2 + 1 = 3; - ітератор_циклу - збільшення лічильника

//Четверта ітерація
//i = 3; - інціалізація_циклу
//3 < 3; - умова_циклу - не виконується
